### Introduction To Pandas

In [1]:
pop = [30.50,2.88,39.11]
countries = ['China','India','Albania']

In [2]:
alb = countries.index('Albania')

In [3]:
alb

2

In [4]:
pop[alb]

39.11

**Dictionaries**

In [5]:
world = {'China':30.50,'India':2.88,'Albania':39.11}

In [6]:
world

{'China': 30.5, 'India': 2.88, 'Albania': 39.11}

In [7]:
world['India']

2.88

In [26]:
world = {'countries':['China', 'India', 'Albania'], 
         'Populations':[39.11, 22.71, 96.12]
         }
world

{'countries': ['China', 'India', 'Albania'],
 'Populations': [39.11, 22.71, 96.12]}

In [27]:
world['countries']

['China', 'India', 'Albania']

In [28]:
world['countries'][0]

'China'

### Dataframe (table)

In [29]:
import pandas as pd

In [35]:
df = pd.DataFrame(world)

df

  countries  Populations
0     China        39.11
1     India        22.71
2   Albania        96.12

In [ ]:
# column extraction METHOD-1

df.countries

0      China
1      India
2    Albania
Name: countries, dtype: object

In [40]:
# column extraction METHOD-2

df['countries'] # if the column with spaces like df['countries name']

0      China
1      India
2    Albania
Name: countries, dtype: object

In [41]:
print(type(df), type(df.countries))

<class 'pandas.core.frame.DataFrame'> <class 'pandas.core.series.Series'>

## Pandas Data Frame Methods

In [50]:
# dataframe methods

df.head(2)

  countries  Populations
0     China        39.11
1     India        22.71

In [51]:
df.tail(2)

  countries  Populations
1     India        22.71
2   Albania        96.12

In [52]:
df.sample()

  countries  Populations
1     India        22.71

In [53]:
df.sample(2)

  countries  Populations
2   Albania        96.12
0     China        39.11

In [54]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [55]:
df.columns

Index(['countries', 'Populations'], dtype='object')

In [56]:
df.shape

(3, 2)

In [64]:
df.rename(columns={'countries':'Country'},inplace=True)

In [65]:
df

   Country  Populations
0    China        39.11
1    India        22.71
2  Albania        96.12

In [69]:
bricks = {"country": ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
         "capital": ['Brazilia', 'Moscow', 'New Delhi', 'Beijing', 'Pretoria'],
         "area": [8.516, 17.100, 3.286, 9.597, 1.221],
         "population": [200.40, 143.50, 1252.00, 1357.00, 52.98]}

df = pd.DataFrame(bricks)
df

        country    capital    area  population
0        Brazil   Brazilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [72]:
df.set_index('country', inplace=True)

In [73]:
df

                capital    area  population
country
Brazil         Brazilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98